{
  "dialog": {
        "dialogText": "Upon his death bed your grandfather holds your hand and explains \"You see this house, when your father was alive he wanted you to live peacefully without worrying about money so he had begun to build this place for you and your mother, unfortunately they both died in that horrible accident and he couldn't finish the task. I love you, since the first time I saw you when you were little and all these years taking care of you have been wonderful, but I am very old and my time is counted. My dear I want you to have this house, and live a happy life like your father and mother wanted for you.\"",
        "choice": {
          "choice1Text": "Go towards the town",
          "choice1Link": "/dialogs-data/dialog1",
          "choice2Text": "Go towards the farm",
          "choice2Link": "/dialogs-data/dialog2",
          "choice3Text": "Go towards the forest",
          "choice3Link": "/dialogs-data/dialog3"
        }
    },

  "dialog1": {
        "dialogText": "The town is on fire, the villagers run desperately trying to rescue their families and possessions from their blazing homes. An army of men dressed with golden armor raid the city, but they don’t seem like common thieves, in fact they don’t take anything from the houses. You wonder what is happening when a soldier notices you and begins to chase you. You now remember a story your grandfather used to tell you about men dressed as the sun, those men dressed in golden armor are the dragons' soldiers.",
        "choice": {
          "choice1Text": "Confront the soldier",
          "choice1Link": "/dialogs-data/dialog11",
          "choice2Text": "Run towards the forest",
          "choice2Link": "/dialogs-data/dialog12",
          "choice3Text": "Play dead",
          "choice3Link": "/dialogs-data/dialog13"
        }
    },

  "dialog2": {
        "dialogText": "As you approach the farm, you see that the soldiers are setting the farm ablaze. Farm animals are escaping from the barn, and running towards a near by field, where no soldiers are posted. Towards the entrance of the stables is an old man, stabbed through the heart, pegged to a wall. His eyes were widened in horror. A soldier must have stabbed him, as he was trying to free his animals. You hear a woman's scream, and notice a few yards off group of soldiers ripping away her clothes.",
        "choice": {
          "choice1Text": "Use the animals to distract the soldiers, while you rescue the girl",
          "choice1Link": "/dialogs-data/dialog21",
          "choice2Text": "Take the sword from the dead-mans body, and defend the girl",
          "choice2Link": "/dialogs-data/dialog22",
          "choice3Text": "Hide, and scream that the royal guard is coming",
          "choice3Link": "/dialogs-data/dialog23"
        }
    },

  "dialog3": {
        "dialogText": "You run into the forest, you heart is pumping, vines are tearing at you as you hazardously dive deeper and deeper into the forest. You see a group of soldiers being attacked by a grizzly bear. Not far away you see three fur covered lumps on the ground, the bear's cubs. Their body's looked deformed because their bones had been broken. After some struggle, the soldiers are able to kill the bear, because she lost so much blood from them stabbing her with their spears. After defeating the bear, one soldier stabs her one more time for good measure, as the soldiers leave they take no notice of the cub's bodies, stepping on them as they walk away.",
        "choice": {
          "choice1Text": "Chase the soldiers",
          "choice1Link": "/dialogs-data/dialog31",
          "choice2Text": "Run in the opposite direction the soldiers had gone",
          "choice2Link": "/dialogs-data/dialog32",
          "choice3Text": "Burry the body's of the bears",
          "choice3Link": "/dialogs-data/dialog33"
        }
    },

  "dialog11": {
        "dialogText": "Before you can move a spout of flame falls from the sky and in a second all the soldiers are gone. There is no trace of them, not even a piece of armor. Suddenly you hear those strange screams. You follow the noise till you reach a beautiful hot spring. At the shore of the hot spring you notice a scaled figure covered in blood. As you approach you realiz  its a dragon. You have never seen one before, but you had heard of these large scaled creatures that breathe fire.",
        "choice": {
          "choice1Text": "Help the dragon",
          "choice1Link": "/ending1.html",
          "choice2Text": "Kill the dragon",
          "choice2Link": "/ending2.html",
          "choice3Text": "Call the soldiers",
          "choice3Link": "/ending3.html"
        }
    },

  "dialog12": {
        "dialogText": "You enter the forest and you hear the soldiers footsteps as they enter the town. You duck into some near-by bushes, and wait until you can distinguish both the location and the intentions of the soldiers. As the soldiers come into sight, you see that the soldiers are dragging a chain net. At first you don't realize what is in it, it looks strange and foreign, but it dawns on you that it is a dragon! The dragon moves desperately to break from the net and after some struggle he escapes and kills the soldiers. The dragon hasn't noticed you, but you can see how his movements are getting slower as he seems to be losing blood from the wound on his side.",
        "choice": {
          "choice1Text": "Help the dragon",
          "choice1Link": "/ending1.html",
          "choice2Text": "Kill the dragon",
          "choice2Link": "/ending2.html",
          "choice3Text": "Call the soldiers",
          "choice3Link": "/ending3.html"
        }
    },
  "dialog13": {
        "dialogText": "The soldier approaches you aggressively. His brows are furrowed, and he draws his sword, and quickly slashes at you. You feel a shot of pain in your abdomen and fall to the ground. With his business done, the soldier walks back to his troupe. You realize you aren't mortally hurt, but it was such a surprise that he did that! Not wanting to confront another solider, or worse, have them actually kill you, you decide to just lay there pretending to be dead. You see smoke in the forest some distance off, the soldiers notice it, and head in that direction. You're safe now, the soldiers are gone, no one is around. You stand up, looking around, and see the ruin the soldiers have caused. Not too far away, you see the debris of a building move a little. There is someone trapped under it. Quickly you get up an rush over there to help whoever is trapped under the rubble. Heaving away some lumber you see moving scales. The thing under the rubble is finally able to shake off the rest of the rubble, revealing a dragon, with a gash in it's side.",
        "choice": {
          "choice1Text": "Help the dragon",
          "choice1Link": "/ending1.html",
          "choice2Text": "Kill the dragon",
          "choice2Link": "/ending2.html",
          "choice3Text": "Call the soldiers",
          "choice3Link": "/ending3.html"
        }
    },

  "dialog21": {
        "dialogText": "dialog 1 text",
        "choice": {
          "choice1Text": "Cloud City Bridge",
          "choice1Link": "Don't forget lightsaber",
          "choice2Text": "text",
          "choice2Link": "link",
          "choice3Text": "text",
          "choice3Link": "link"
        }
    },

  "dialog22": {
        "dialogText": "dialog 1 text",
        "choice": {
          "choice1Text": "Cloud City Bridge",
          "choice1Link": "Don't forget lightsaber",
          "choice2Text": "text",
          "choice2Link": "link",
          "choice3Text": "text",
          "choice3Link": "link"
        }
    },

  "dialog23": {
        "dialogText": "dialog 1 text",
        "choice": {
          "choice1Text": "Cloud City Bridge",
          "choice1Link": "Don't forget lightsaber",
          "choice2Text": "text",
          "choice2Link": "link",
          "choice3Text": "text",
          "choice3Link": "link"
        }
    },

  "dialog31": {
        "dialogText": "dialog 1 text",
        "choice": {
          "choice1Text": "Cloud City Bridge",
          "choice1Link": "Don't forget lightsaber",
          "choice2Text": "text",
          "choice2Link": "link",
          "choice3Text": "text",
          "choice3Link": "link"
        }
    },

  "dialog32": {
        "dialogText": "dialog 1 text",
        "choice": {
          "choice1Text": "Cloud City Bridge",
          "choice1Link": "Don't forget lightsaber",
          "choice2Text": "text",
          "choice2Link": "link",
          "choice3Text": "text",
          "choice3Link": "link"
        }
    },

  "dialog33": {
        "dialogText": "dialog 1 text",
        "choice": {
          "choice1Text": "Cloud City Bridge",
          "choice1Link": "Don't forget lightsaber",
          "choice2Text": "text",
          "choice2Link": "link",
          "choice3Text": "text",
          "choice3Link": "link"
    }
  }
}
